; domain
(define (domain slide-domain-grid)
   (:requirements :typing)
   (:types idx tile)
   (:predicates	
		(empty ?r ?c - idx)
		(at ?t - tile ?r ?c - idx)
		(inc ?i  ?j - idx)
		(dec ?i  ?j - idx)
		)		
	
(:action Up
       :parameters  (?t - tile ?rowFrom - idx ?col - idx ?rowTo - idx)
       :precondition (and   (at ?t ?rowFrom ?col) (empty ?rowTo ?col) (dec ?rowFrom ?rowTo)) 
       :effect (and  (empty ?rowFrom ?col) (at ?t ?rowTo ?col)
		     (not (empty ?rowTo ?col)) (not (at ?t ?rowFrom ?col)) ) )

(:action Down
       :parameters  (?t - tile ?rowFrom - idx ?col - idx ?rowTo - idx)
       :precondition (and   (at ?t ?rowFrom ?col) (empty ?rowTo ?col) (inc ?rowFrom ?rowTo)) 
       :effect (and  (empty ?rowFrom ?col) (at ?t ?rowTo ?col)
		     (not (empty ?rowTo ?col)) (not (at ?t ?rowFrom ?col)) ) )

(:action Right ; down pretty sure that parameters is just naming your variables 
       :parameters  (?t - tile ?row - idx ?colFrom - idx ?colTo - idx)
       :precondition (and   (at ?t ?row ?colFrom) (empty ?row ?colTo) (inc ?colFrom ?colTo));(inc ?rowFrom ?rowTo)) 
       :effect (and  (empty ?row ?colFrom) (at ?t ?row ?colTo)
		     (not (empty ?row ?colTo)) (not (at ?t ?row ?colFrom)) ) )

(:action Left ; up similar 
       :parameters  (?t - tile ?row - idx ?colFrom - idx ?colTo - idx)
       :precondition (and   (at ?t ?row ?colFrom) (empty ?row ?colTo) (dec ?colFrom ?colTo)) 
       :effect (and  (empty ?row ?colFrom) (at ?t ?row ?colTo)
		     (not (empty ?row ?colTo)) (not (at ?t ?row ?colFrom)) ) )
)

; problem
(define (problem 3x3test)
 (:domain slide-domain-grid)
 (:objects 1 2 3 - idx
 tile1 tile2 tile3 tile4 tile5 tile6 tile7 tile8 - tile)
 (:init
 ;; inc and dec
 (inc 1 2) (inc 2 3) (dec 3 2) (dec 2 1)
 ;; board after applying 100 random moves solution length=27
 ;; a difficult state
 ;; [4, 7, 1]
 ;; [0, 8, 6]
 ;; [2, 5, 3]
 	;; [3, 1, 5]
	;; [6, 7, 2]
	;; [4, 0, 8]
 (at tile3 1 1) (at tile1 1 2) (at tile5 1 3)
 (at tile6 2 1) (at tile7 2 2) (at tile2 2 3)
 (at tile4 3 1) (empty 3 2) (at tile8 3 3))

 (:goal (and (empty 1 1) (at tile1 1 2) (at tile2 1 3)
 (at tile3 2 1) (at tile4 2 2) (at tile5 2 3)
 (at tile6 3 1) (at tile7 3 2) (at tile8 3 3) ))
 
 )



; (define (problem 3x3test)
;    (:domain slide-domain-grid)
;    (:objects 1 2 3 - idx
; 	tile1 tile2 tile3 tile4 tile5 tile6 tile7 tile8 - tile)
;    (:init 



	;; inc and dec predicates !!
	;; you need to define these operations in logic




	;; (SUBMIT THIS ONE) board after applying 35 random moves solution length=15 ... a medium difficulty state
	;; [3, 1, 5]
	;; [6, 7, 2]
	;; [4, 0, 8]



	;; board after applying 100 random moves solution as length=27 ... a difficult state
	;; [4, 7, 1]
	;; [0, 8, 6]
	;; [2, 5, 3]

; )
;    (:goal (and 
	
; 	   )
; ))

; plan
1. (down tile7 2 2 3)
   deleted: (empty 3 2) (at tile7 2 2)
   added: (empty 2 2) (at tile7 3 2)
   goals met: 3 of 9
2. (left tile2 2 3 2)
   deleted: (empty 2 2) (at tile2 2 3)
   added: (empty 2 3) (at tile2 2 2)
   goals met: 3 of 9
3. (up tile8 3 3 2)
   deleted: (empty 2 3) (at tile8 3 3)
   added: (empty 3 3) (at tile8 2 3)
   goals met: 2 of 9
4. (right tile7 3 2 3)
   deleted: (empty 3 3) (at tile7 3 2)
   added: (empty 3 2) (at tile7 3 3)
   goals met: 1 of 9
5. (right tile4 3 1 2)
   deleted: (empty 3 2) (at tile4 3 1)
   added: (empty 3 1) (at tile4 3 2)
   goals met: 1 of 9
6. (down tile6 2 1 3)
   deleted: (empty 3 1) (at tile6 2 1)
   added: (empty 2 1) (at tile6 3 1)
   goals met: 2 of 9
7. (down tile3 1 1 2)
   deleted: (empty 2 1) (at tile3 1 1)
   added: (empty 1 1) (at tile3 2 1)
   goals met: 4 of 9
8. (left tile1 1 2 1)
   deleted: (empty 1 1) (at tile1 1 2)
   added: (empty 1 2) (at tile1 1 1)
   goals met: 2 of 9
9. (up tile2 2 2 1)
   deleted: (empty 1 2) (at tile2 2 2)
   added: (empty 2 2) (at tile2 1 2)
   goals met: 2 of 9
10. (up tile4 3 2 2)
   deleted: (empty 2 2) (at tile4 3 2)
   added: (empty 3 2) (at tile4 2 2)
   goals met: 3 of 9
11. (left tile7 3 3 2)
   deleted: (empty 3 2) (at tile7 3 3)
   added: (empty 3 3) (at tile7 3 2)
   goals met: 4 of 9
12. (down tile8 2 3 3)
   deleted: (empty 3 3) (at tile8 2 3)
   added: (empty 2 3) (at tile8 3 3)
   goals met: 5 of 9
13. (down tile5 1 3 2)
   deleted: (empty 2 3) (at tile5 1 3)
   added: (empty 1 3) (at tile5 2 3)
   goals met: 6 of 9
14. (right tile2 1 2 3)
   deleted: (empty 1 3) (at tile2 1 2)
   added: (empty 1 2) (at tile2 1 3)
   goals met: 7 of 9
15. (right tile1 1 1 2)
   deleted: (empty 1 2) (at tile1 1 1)
   added: (empty 1 1) (at tile1 1 2)
   goals met: 9 of 9
